#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.training-cluster.tls_private_key.terraform: Refreshing state... [id=5b2b1ef56404169e3835af252f5ebfc823dbc222]
module.training-cluster.hcloud_network.network: Refreshing state... [id=3164600]
module.training-cluster.hcloud_placement_group.controlplane: Refreshing state... [id=187331]
module.training-cluster.hcloud_load_balancer.lb: Refreshing state... [id=1371818]
module.training-cluster.random_password.student-passwords[7]: Refreshing state... [id=none]
module.training-cluster.random_password.student-passwords[2]: Refreshing state... [id=none]
module.training-cluster.random_password.student-passwords[6]: Refreshing state... [id=none]
module.training-cluster.random_password.student-passwords[0]: Refreshing state... [id=none]
module.training-cluster.random_password.student-passwords[5]: Refreshing state... [id=none]
module.training-cluster.random_password.student-passwords[1]: Refreshing state... [id=none]
module.training-cluster.random_password.student-passwords[3]: Refreshing state... [id=none]
module.training-cluster.random_password.student-passwords[4]: Refreshing state... [id=none]
module.training-cluster.random_password.student-passwords[8]: Refreshing state... [id=none]
module.training-cluster.random_password.argocd-admin-password: Refreshing state... [id=none]
module.training-cluster.random_password.rke2_cluster_secret: Refreshing state... [id=none]
module.training-cluster.hcloud_ssh_key.terraform: Refreshing state... [id=13562986]
module.training-cluster.random_password.student-passwords[9]: Refreshing state... [id=none]
module.training-cluster.hcloud_network_subnet.subnet: Refreshing state... [id=3164600-10.0.0.0/24]
module.training-cluster.hcloud_load_balancer_service.rke2: Refreshing state... [id=1371818__9345]
module.training-cluster.hcloud_load_balancer_network.lb: Refreshing state... [id=1371818-3164600]
module.training-cluster.module.api-aaaa-record.restapi_object.aaaa-record[0]: Refreshing state... [id=2785173]
module.training-cluster.module.api-a-record.restapi_object.a-record[0]: Refreshing state... [id=2785174]
module.training-cluster.hcloud_load_balancer_service.api: Refreshing state... [id=1371818__6443]
module.training-cluster.hcloud_load_balancer_target.controlplane: Refreshing state... [id=lb-label-selector-tgt-28ad2ff0dac499e2dc5a0d327c5a84fa206b6f31e5813b70c1978ece66225a11-1371818]
module.training-cluster.hcloud_server.worker[0]: Refreshing state... [id=35304317]
module.training-cluster.hcloud_server.worker[1]: Refreshing state... [id=35304318]
module.training-cluster.hcloud_server.worker[2]: Refreshing state... [id=35304319]
module.training-cluster.hcloud_server_network.worker[0]: Refreshing state... [id=35304317-3164600]
module.training-cluster.hcloud_server_network.worker[1]: Refreshing state... [id=35304318-3164600]
module.training-cluster.hcloud_server_network.worker[2]: Refreshing state... [id=35304319-3164600]
module.training-cluster.hcloud_server.controlplane[0]: Refreshing state... [id=35304324]
module.training-cluster.hcloud_server.controlplane[2]: Refreshing state... [id=35304321]
module.training-cluster.hcloud_server.controlplane[1]: Refreshing state... [id=35304325]
module.training-cluster.hcloud_server_network.controlplane[2]: Refreshing state... [id=35304321-3164600]
module.training-cluster.hcloud_server_network.controlplane[0]: Refreshing state... [id=35304324-3164600]
module.training-cluster.hcloud_firewall.firewall: Refreshing state... [id=986372]
module.training-cluster.hcloud_server_network.controlplane[1]: Refreshing state... [id=35304325-3164600]
module.training-cluster.null_resource.wait_for_k8s_api: Refreshing state... [id=3514550289398218606]
module.training-cluster.ssh_resource.getkubeconfig: Refreshing state... [id=2953639524585512285]
module.training-cluster.kubernetes_namespace.argocd: Refreshing state... [id=argocd]
module.training-cluster.helm_release.argocd: Refreshing state... [id=argocd]
module.training-cluster.time_sleep.wait_for_argocd-cleanup: Refreshing state... [id=2023-07-27T11:04:46Z]
module.training-cluster.time_sleep.wait_for_bootstrap: Refreshing state... [id=2023-07-27T11:05:16Z]
module.training-cluster.helm_release.appset-trainee-webshell[0]: Refreshing state... [id=trainee-webshell]
module.training-cluster.helm_release.appset-trainee-env[0]: Refreshing state... [id=trainee-env]
module.training-cluster.kubernetes_secret.secretstore-secret: Refreshing state... [id=external-secrets/credentials-training.cluster.acend.ch]
module.training-cluster.kubernetes_secret.argocd-cluster: Refreshing state... [id=argocd/training]
module.training-cluster.null_resource.cleanup-argo-cr-before-destroy: Refreshing state... [id=2400821005921542469]
module.training-cluster.kubernetes_manifest.external-secrets-secretstore["kube-system"]: Refreshing state...
module.training-cluster.kubernetes_manifest.external-secrets-secretstore["cert-manager"]: Refreshing state...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.training-cluster.hcloud_server.worker[3] will be created
  + resource "hcloud_server" "worker" {
      + allow_deprecated_images    = false
      + backup_window              = (known after apply)
      + backups                    = false
      + datacenter                 = (known after apply)
      + delete_protection          = false
      + firewall_ids               = (known after apply)
      + id                         = (known after apply)
      + ignore_remote_firewall_ids = false
      + image                      = "ubuntu-22.04"
      + ipv4_address               = (known after apply)
      + ipv6_address               = (known after apply)
      + ipv6_network               = (known after apply)
      + keep_disk                  = false
      + labels                     = {
          + "cluster" = "training"
          + "worker"  = "true"
        }
      + location                   = "nbg1"
      + name                       = "training-worker-3"
      + rebuild_protection         = false
      + server_type                = "cpx41"
      + ssh_keys                   = [
          + "terraform-training",
        ]
      + status                     = (known after apply)
      + user_data                  = (sensitive value)
    }

  # module.training-cluster.hcloud_server.worker[4] will be created
  + resource "hcloud_server" "worker" {
      + allow_deprecated_images    = false
      + backup_window              = (known after apply)
      + backups                    = false
      + datacenter                 = (known after apply)
      + delete_protection          = false
      + firewall_ids               = (known after apply)
      + id                         = (known after apply)
      + ignore_remote_firewall_ids = false
      + image                      = "ubuntu-22.04"
      + ipv4_address               = (known after apply)
      + ipv6_address               = (known after apply)
      + ipv6_network               = (known after apply)
      + keep_disk                  = false
      + labels                     = {
          + "cluster" = "training"
          + "worker"  = "true"
        }
      + location                   = "nbg1"
      + name                       = "training-worker-4"
      + rebuild_protection         = false
      + server_type                = "cpx41"
      + ssh_keys                   = [
          + "terraform-training",
        ]
      + status                     = (known after apply)
      + user_data                  = (sensitive value)
    }

  # module.training-cluster.hcloud_server_network.worker[3] will be created
  + resource "hcloud_server_network" "worker" {
      + id          = (known after apply)
      + ip          = (known after apply)
      + mac_address = (known after apply)
      + network_id  = 3164600
      + server_id   = (known after apply)
    }

  # module.training-cluster.hcloud_server_network.worker[4] will be created
  + resource "hcloud_server_network" "worker" {
      + id          = (known after apply)
      + ip          = (known after apply)
      + mac_address = (known after apply)
      + network_id  = 3164600
      + server_id   = (known after apply)
    }

  # module.training-cluster.helm_release.appset-trainee-env[0] will be updated in-place
  ~ resource "helm_release" "appset-trainee-env" {
        id                         = "trainee-env"
      ~ metadata                   = [
          - {
              - app_version = ""
              - chart       = "argocd-apps"
              - name        = "trainee-env"
              - namespace   = "argocd"
              - revision    = 1
              - values      = jsonencode(
                    {
                      - applicationsets = [
                          - {
                              - generators = [
                                  - {
                                      - list = {
                                          - elements = [
                                              - {
                                                  - cluster_admin = "true"
                                                  - password      = "v80O6Vzqr3pmBduQ"
                                                  - traineename   = "user1"
                                                },
                                              - {
                                                  - cluster_admin = "true"
                                                  - password      = "rrKLy2NpUMQY-Uxq"
                                                  - traineename   = "user2"
                                                },
                                              - {
                                                  - cluster_admin = "true"
                                                  - password      = "65nuQVe3jr4nYw1S"
                                                  - traineename   = "user3"
                                                },
                                              - {
                                                  - cluster_admin = "false"
                                                  - password      = "UL037VWLrw0dZlSU"
                                                  - traineename   = "user4"
                                                },
                                              - {
                                                  - cluster_admin = "false"
                                                  - password      = "4GyvwN4mmbS9wkRS"
                                                  - traineename   = "user5"
                                                },
                                              - {
                                                  - cluster_admin = "false"
                                                  - password      = "DC4CSptKWb-FsBa3"
                                                  - traineename   = "user6"
                                                },
                                              - {
                                                  - cluster_admin = "false"
                                                  - password      = "OQBhQyq1NPHU4GWP"
                                                  - traineename   = "user7"
                                                },
                                              - {
                                                  - cluster_admin = "false"
                                                  - password      = "seIP4jHaLwGPngWO"
                                                  - traineename   = "user8"
                                                },
                                              - {
                                                  - cluster_admin = "false"
                                                  - password      = "JWRi8GNncPG5tdjs"
                                                  - traineename   = "user9"
                                                },
                                              - {
                                                  - cluster_admin = "false"
                                                  - password      = "_F4HHDmCBgHuQw16"
                                                  - traineename   = "user10"
                                                },
                                            ]
                                        }
                                    },
                                ]
                              - name       = "trainee-env"
                              - namespace  = "argocd"
                              - template   = {
                                  - metadata = {
                                      - name = "{{traineename}}-env"
                                    }
                                  - spec     = {
                                      - destination = {
                                          - server = "https://kubernetes.default.svc"
                                        }
                                      - project     = "trainee-environment"
                                      - source      = {
                                          - helm           = {
                                              - releaseName = "{{traineename}}-env"
                                              - values      = <<-EOT
                                                    user: {{traineename}}
                                                    password: {{password}}
                                                    cluster_name: training
                                                    cluster_domain: cluster.acend.ch
                                                    cluster_admin: {{cluster_admin}}
                                                EOT
                                            }
                                          - path           = "charts/user-env"
                                          - repoURL        = "https://github.com/acend/terraform-k8s-cluster-lab"
                                          - targetRevision = "HEAD"
                                        }
                                      - syncPolicy  = {
                                          - automated = {
                                              - prune    = true
                                              - selfHeal = true
                                            }
                                        }
                                    }
                                }
                            },
                        ]
                    }
                )
              - version     = "1.2.0"
            },
        ] -> (known after apply)
        name                       = "trainee-env"
      ~ values                     = [
          - (sensitive value),
        ] -> (known after apply)
        # (26 unchanged attributes hidden)
    }

  # module.training-cluster.helm_release.appset-trainee-webshell[0] will be updated in-place
  ~ resource "helm_release" "appset-trainee-webshell" {
        id                         = "trainee-webshell"
      ~ metadata                   = [
          - {
              - app_version = ""
              - chart       = "argocd-apps"
              - name        = "trainee-webshell"
              - namespace   = "argocd"
              - revision    = 2
              - values      = jsonencode(
                    {
                      - applicationsets = [
                          - {
                              - generators = [
                                  - {
                                      - list = {
                                          - elements = [
                                              - {
                                                  - password    = "$2a$10$A.s745kbofNQYBtQzl4wQO1x7BxbOyIs.ezEy6HvCw9dTOo8wOtmm"
                                                  - traineename = "user1"
                                                },
                                              - {
                                                  - password    = "$2a$10$iI0wmHKcuVM2UXYRN.BQqOKJTLc5sM91CXqhGwdZtU2E4Zoh.aqce"
                                                  - traineename = "user2"
                                                },
                                              - {
                                                  - password    = "$2a$10$ITwtSHZzgOqsRAx3U9ZdluYue8M9Uym4Nwtorc/f43OzR8izYo/wO"
                                                  - traineename = "user3"
                                                },
                                              - {
                                                  - password    = "$2a$10$bgEidMJPr9Fw4AgtE0O5WOm82d6juIIsqUJQ6nza8MYHW3kgxrQj6"
                                                  - traineename = "user4"
                                                },
                                              - {
                                                  - password    = "$2a$10$gvhQ6xtyHBoRVP.I7JqROuVN2yUARb3rI2jFi1lpckhMk.uJBT.eu"
                                                  - traineename = "user5"
                                                },
                                              - {
                                                  - password    = "$2a$10$4xW.XROJmlGLfb/jq6.GOOJaPFmg5ht9p3YCVzIMGoX0xSvcBEqBS"
                                                  - traineename = "user6"
                                                },
                                              - {
                                                  - password    = "$2a$10$TEVyCKesc0HZzwokUD4bBOgvvOGj3w0vRD0ArTaFGGjN20CymUqJy"
                                                  - traineename = "user7"
                                                },
                                              - {
                                                  - password    = "$2a$10$BKi.9m9UFPc1HkGc4XEFr.jDPfB8lgoqbCdU8YKA8/WoXfT6EPHs6"
                                                  - traineename = "user8"
                                                },
                                              - {
                                                  - password    = "$2a$10$gXeimpIGLpKksnT0J8nt.OGKpNEP0BlTh58kJWGcda1DMGNkI9kRe"
                                                  - traineename = "user9"
                                                },
                                              - {
                                                  - password    = "$2a$10$HJy4/embl9QPb.EBS4yuLuAZJY8XmtnqEkyQ6r.NO/kERHTKIiicy"
                                                  - traineename = "user10"
                                                },
                                            ]
                                        }
                                    },
                                ]
                              - name       = "trainee-webshell"
                              - namespace  = "argocd"
                              - template   = {
                                  - metadata = {
                                      - name = "{{traineename}}-webshell"
                                    }
                                  - spec     = {
                                      - destination = {
                                          - namespace = "{{traineename}}"
                                          - server    = "https://kubernetes.default.svc"
                                        }
                                      - project     = "trainee-environment"
                                      - source      = {
                                          - chart          = "webshell"
                                          - helm           = {
                                              - releaseName = "{{traineename}}-webshell"
                                              - values      = <<-EOT
                                                    user: {{traineename}}
                                                    password: {{password}}
                                                    ingress:
                                                      enabled: true
                                                      className: haproxy
                                                      annotations:
                                                        nginx.ingress.kubernetes.io/auth-type: basic-auth
                                                        nginx.ingress.kubernetes.io/auth-secret: basic-auth
                                                      hosts:
                                                      - host: {{traineename}}.training.cluster.acend.ch
                                                        paths:
                                                        - path: /
                                                          pathType: ImplementationSpecific
                                                      tls:
                                                      - hosts:
                                                        - {{traineename}}.training.cluster.acend.ch
                                                        secretName: acend-wildcard
                                                    theia:
                                                      persistence:
                                                        enabled: true
                                                        storageclass: longhorn
                                                      resources: 
                                                        limits:
                                                          memory: 1Gi
                                                        requests:
                                                          cpu: 50m
                                                          memory: 100Mi
                                                    dind:
                                                      persistence:
                                                        enabled: true
                                                        storageclass: longhorn
                                                        pvcsize: 10Gi
                                                      resources: 
                                                        requests:
                                                          cpu: 1000m
                                                          memory: 1Gi
                                                    podSecurityContext:
                                                      fsGroup: 1001
                                                    updateStrategy:
                                                      type: Recreate
                                                    rbac:
                                                      create: true   
                                                    init:
                                                      command:
                                                      - sh
                                                      - -c
                                                      - echo Welcome to the acend theia ide > /home/project/welcome
                                                EOT
                                            }
                                          - repoURL        = "https://acend.github.io/webshell-env/"
                                          - targetRevision = "0.3.3"
                                        }
                                      - syncPolicy  = {
                                          - automated = {
                                              - prune    = true
                                              - selfHeal = true
                                            }
                                        }
                                    }
                                }
                            },
                        ]
                    }
                )
              - version     = "1.2.0"
            },
        ] -> (known after apply)
        name                       = "trainee-webshell"
      ~ values                     = [
          - (sensitive value),
        ] -> (known after apply)
        # (26 unchanged attributes hidden)
    }

  # module.training-cluster.helm_release.argocd will be updated in-place
  ~ resource "helm_release" "argocd" {
        id                         = "argocd"
      ~ metadata                   = [
          - {
              - app_version = "v2.7.8"
              - chart       = "argo-cd"
              - name        = "argocd"
              - namespace   = "argocd"
              - revision    = 3
              - values      = jsonencode(
                    {
                      - configs    = {
                          - cm     = {
                              - "dex.config" = <<-EOT
                                    connectors:
                                      - type: gitea
                                        id: gitea
                                        name: Gitea
                                        config:
                                          clientID: $gitea-oauthclient-argocd:client_id
                                          clientSecret: $gitea-oauthclient-argocd:client_secret
                                          redirectURI: https://argocd.training.cluster.acend.ch/api/dex/callback
                                          baseURL: https://gitea.training.cluster.acend.ch
                                          loadAllGroups: true
                                EOT
                              - url          = "https://argocd.training.cluster.acend.ch"
                            }
                          - params = {
                              - "server.insecure" = true
                            }
                          - rbac   = {
                              - "policy.csv" = <<-EOT
                                    p, role:student, applications, *, */*, allow
                                    
                                    p, role:student, applications, *, infra/*, deny
                                    p, role:student, applications, *, trainee-environment/*, deny
                                    
                                    p, role:student, clusters, get, *, allow
                                    p, role:student, clusters, update, *, allow
                                    p, role:student, repositories, get, *, allow
                                    p, role:student, repositories, create, *, allow
                                    p, role:student, repositories, update, *, allow
                                    p, role:student, repositories, delete, *, allow
                                    
                                    p, role:student, projects, get, *, allow
                                    p, role:student, projects, create, *, allow
                                    p, role:student, projects, update, *, allow
                                    p, role:student, projects, delete, *, allow
                                    
                                    p, role:student, projects, *, infra, deny
                                    p, role:student, projects, *, trainee-environment, deny
                                    
                                    g, acend:trainees, role:student
                                    
                                    g, user1, role:student
                                    g, user2, role:student
                                    g, user3, role:student
                                    g, user4, role:student
                                    g, user5, role:student
                                    g, user6, role:student
                                    g, user7, role:student
                                    g, user8, role:student
                                    g, user9, role:student
                                    g, user10, role:student
                                    
                                    g, acend:admins, role:admin
                                EOT
                            }
                          - secret = {
                              - argocdServerAdminPassword = "$2a$10$CMmgI1yAXMXcNcF1w9QchuPP5.RgtrnhTxLMgC7exj4toGez1.zuG"
                              - extra                     = {
                                  - "accounts.user1.password"       = "$2a$10$A.s745kbofNQYBtQzl4wQO1x7BxbOyIs.ezEy6HvCw9dTOo8wOtmm"
                                  - "accounts.user1.passwordMtime"  = "2023-07-27T11:43:04Z"
                                  - "accounts.user10.password"      = "$2a$10$HJy4/embl9QPb.EBS4yuLuAZJY8XmtnqEkyQ6r.NO/kERHTKIiicy"
                                  - "accounts.user10.passwordMtime" = "2023-07-27T11:43:04Z"
                                  - "accounts.user2.password"       = "$2a$10$iI0wmHKcuVM2UXYRN.BQqOKJTLc5sM91CXqhGwdZtU2E4Zoh.aqce"
                                  - "accounts.user2.passwordMtime"  = "2023-07-27T11:43:04Z"
                                  - "accounts.user3.password"       = "$2a$10$ITwtSHZzgOqsRAx3U9ZdluYue8M9Uym4Nwtorc/f43OzR8izYo/wO"
                                  - "accounts.user3.passwordMtime"  = "2023-07-27T11:43:04Z"
                                  - "accounts.user4.password"       = "$2a$10$bgEidMJPr9Fw4AgtE0O5WOm82d6juIIsqUJQ6nza8MYHW3kgxrQj6"
                                  - "accounts.user4.passwordMtime"  = "2023-07-27T11:43:04Z"
                                  - "accounts.user5.password"       = "$2a$10$gvhQ6xtyHBoRVP.I7JqROuVN2yUARb3rI2jFi1lpckhMk.uJBT.eu"
                                  - "accounts.user5.passwordMtime"  = "2023-07-27T11:43:04Z"
                                  - "accounts.user6.password"       = "$2a$10$4xW.XROJmlGLfb/jq6.GOOJaPFmg5ht9p3YCVzIMGoX0xSvcBEqBS"
                                  - "accounts.user6.passwordMtime"  = "2023-07-27T11:43:04Z"
                                  - "accounts.user7.password"       = "$2a$10$TEVyCKesc0HZzwokUD4bBOgvvOGj3w0vRD0ArTaFGGjN20CymUqJy"
                                  - "accounts.user7.passwordMtime"  = "2023-07-27T11:43:04Z"
                                  - "accounts.user8.password"       = "$2a$10$BKi.9m9UFPc1HkGc4XEFr.jDPfB8lgoqbCdU8YKA8/WoXfT6EPHs6"
                                  - "accounts.user8.passwordMtime"  = "2023-07-27T11:43:04Z"
                                  - "accounts.user9.password"       = "$2a$10$gXeimpIGLpKksnT0J8nt.OGKpNEP0BlTh58kJWGcda1DMGNkI9kRe"
                                  - "accounts.user9.passwordMtime"  = "2023-07-27T11:43:04Z"
                                }
                            }
                        }
                      - controller = {
                          - metrics = {
                              - enabled = true
                            }
                        }
                      - global     = {
                          - nodeSelector = {
                              - "node-role.kubernetes.io/control-plane" = "true"
                            }
                          - tolerations  = [
                              - {
                                  - effect   = "NoSchedule"
                                  - key      = "node-role.kubernetes.io/control-plane"
                                  - operator = "Equal"
                                  - value    = "true"
                                },
                            ]
                        }
                      - server     = {
                          - config      = {
                              - "accounts.user1"         = "apiKey, login"
                              - "accounts.user10"        = "apiKey, login"
                              - "accounts.user2"         = "apiKey, login"
                              - "accounts.user3"         = "apiKey, login"
                              - "accounts.user4"         = "apiKey, login"
                              - "accounts.user5"         = "apiKey, login"
                              - "accounts.user6"         = "apiKey, login"
                              - "accounts.user7"         = "apiKey, login"
                              - "accounts.user8"         = "apiKey, login"
                              - "accounts.user9"         = "apiKey, login"
                              - "kustomize.buildOptions" = "--enable-helm"
                              - "resource.exclusions"    = <<-EOT
                                    - kinds:
                                      - "CiliumIdentity"
                                      - "ciliumidentities"
                                      - "CiliumEndpoint"
                                      - "ciliumendpoints"
                                      - "CiliumNode"
                                      - "ciliumnodes"
                                EOT
                            }
                          - ingress     = {
                              - enabled          = true
                              - hosts            = [
                                  - "argocd.training.cluster.acend.ch",
                                ]
                              - ingressClassName = "haproxy"
                              - tls              = [
                                  - {
                                      - hosts      = [
                                          - "argocd.training.cluster.acend.ch",
                                        ]
                                      - secretName = "acend-wildcard"
                                    },
                                ]
                            }
                          - ingressGrpc = {
                              - enabled          = true
                              - hosts            = [
                                  - "argocd-grpc.training.cluster.acend.ch",
                                ]
                              - ingressClassName = "haproxy"
                              - tls              = [
                                  - {
                                      - hosts      = [
                                          - "argocd-grpc.training.cluster.acend.ch",
                                        ]
                                      - secretName = "acend-wildcard"
                                    },
                                ]
                            }
                        }
                    }
                )
              - version     = "5.41.1"
            },
        ] -> (known after apply)
        name                       = "argocd"
      ~ values                     = [
          - (sensitive value),
          - <<-EOT
                configs:
                  rbac: 
                    policy.csv: |
                      p, role:student, applications, *, */*, allow
                
                      p, role:student, applications, *, infra/*, deny
                      p, role:student, applications, *, trainee-environment/*, deny
                
                      p, role:student, clusters, get, *, allow
                      p, role:student, clusters, update, *, allow
                      p, role:student, repositories, get, *, allow
                      p, role:student, repositories, create, *, allow
                      p, role:student, repositories, update, *, allow
                      p, role:student, repositories, delete, *, allow
                
                      p, role:student, projects, get, *, allow
                      p, role:student, projects, create, *, allow
                      p, role:student, projects, update, *, allow
                      p, role:student, projects, delete, *, allow
                
                      p, role:student, projects, *, infra, deny
                      p, role:student, projects, *, trainee-environment, deny
                
                      g, acend:trainees, role:student
                
                      g, user1, role:student
                      g, user2, role:student
                      g, user3, role:student
                      g, user4, role:student
                      g, user5, role:student
                      g, user6, role:student
                      g, user7, role:student
                      g, user8, role:student
                      g, user9, role:student
                      g, user10, role:student
                
                      g, acend:admins, role:admin
            EOT,
          - <<-EOT
                global:
                  nodeSelector:
                    node-role.kubernetes.io/control-plane: "true"
                  tolerations:
                  - key: node-role.kubernetes.io/control-plane
                    operator: Equal
                    value: "true"
                    effect: "NoSchedule"
                
                controller:
                  metrics:
                    enabled: true
                
                configs:
                  cm:
                    dex.config: |
                      connectors:
                        - type: gitea
                          id: gitea
                          name: Gitea
                          config:
                            clientID: $gitea-oauthclient-argocd:client_id
                            clientSecret: $gitea-oauthclient-argocd:client_secret
                            redirectURI: https://argocd.training.cluster.acend.ch/api/dex/callback
                            baseURL: https://gitea.training.cluster.acend.ch
                            loadAllGroups: true
                  params:
                    server.insecure: true
                
                server:
                  config:
                    kustomize.buildOptions: "--enable-helm"
                    resource.exclusions: |
                      - kinds:
                        - "CiliumIdentity"
                        - "ciliumidentities"
                        - "CiliumEndpoint"
                        - "ciliumendpoints"
                        - "CiliumNode"
                        - "ciliumnodes"
                  ingress:
                    enabled: true
                    ingressClassName: haproxy
                    tls:
                    - secretName: acend-wildcard
                  ingressGrpc:
                    enabled: true
                    ingressClassName: haproxy
                    tls:
                    - secretName: acend-wildcard
            EOT,
        ] -> (known after apply)
        # (26 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.training-cluster.random_password.student-passwords[10] will be created
  + resource "random_password" "student-passwords" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = ".-_"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.training-cluster.random_password.student-passwords[11] will be created
  + resource "random_password" "student-passwords" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = ".-_"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.training-cluster.random_password.student-passwords[12] will be created
  + resource "random_password" "student-passwords" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = ".-_"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.training-cluster.random_password.student-passwords[13] will be created
  + resource "random_password" "student-passwords" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = ".-_"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.training-cluster.random_password.student-passwords[14] will be created
  + resource "random_password" "student-passwords" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = ".-_"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.training-cluster.random_password.student-passwords[15] will be created
  + resource "random_password" "student-passwords" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = ".-_"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.training-cluster.random_password.student-passwords[16] will be created
  + resource "random_password" "student-passwords" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = ".-_"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.training-cluster.random_password.student-passwords[17] will be created
  + resource "random_password" "student-passwords" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = ".-_"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.training-cluster.random_password.student-passwords[18] will be created
  + resource "random_password" "student-passwords" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = ".-_"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.training-cluster.random_password.student-passwords[19] will be created
  + resource "random_password" "student-passwords" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = ".-_"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.training-cluster.random_password.student-passwords[20] will be created
  + resource "random_password" "student-passwords" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = ".-_"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.training-cluster.random_password.student-passwords[21] will be created
  + resource "random_password" "student-passwords" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = ".-_"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.training-cluster.random_password.student-passwords[22] will be created
  + resource "random_password" "student-passwords" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = ".-_"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.training-cluster.random_password.student-passwords[23] will be created
  + resource "random_password" "student-passwords" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = ".-_"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.training-cluster.random_password.student-passwords[24] will be created
  + resource "random_password" "student-passwords" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = ".-_"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.training-cluster.random_password.student-passwords[25] will be created
  + resource "random_password" "student-passwords" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = ".-_"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.training-cluster.random_password.student-passwords[26] will be created
  + resource "random_password" "student-passwords" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = ".-_"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.training-cluster.random_password.student-passwords[27] will be created
  + resource "random_password" "student-passwords" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = ".-_"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.training-cluster.random_password.student-passwords[28] will be created
  + resource "random_password" "student-passwords" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = ".-_"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.training-cluster.random_password.student-passwords[29] will be created
  + resource "random_password" "student-passwords" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = ".-_"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.training-cluster.random_password.student-passwords[30] will be created
  + resource "random_password" "student-passwords" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = ".-_"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.training-cluster.random_password.student-passwords[31] will be created
  + resource "random_password" "student-passwords" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = ".-_"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.training-cluster.random_password.student-passwords[32] will be created
  + resource "random_password" "student-passwords" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = ".-_"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.training-cluster.random_password.student-passwords[33] will be created
  + resource "random_password" "student-passwords" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = ".-_"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.training-cluster.random_password.student-passwords[34] will be created
  + resource "random_password" "student-passwords" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = ".-_"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.training-cluster.random_password.student-passwords[35] will be created
  + resource "random_password" "student-passwords" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = ".-_"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.training-cluster.random_password.student-passwords[36] will be created
  + resource "random_password" "student-passwords" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = ".-_"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.training-cluster.random_password.student-passwords[37] will be created
  + resource "random_password" "student-passwords" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = ".-_"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.training-cluster.random_password.student-passwords[38] will be created
  + resource "random_password" "student-passwords" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = ".-_"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.training-cluster.random_password.student-passwords[39] will be created
  + resource "random_password" "student-passwords" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = ".-_"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

Plan: 34 to add, 3 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @splattner, Workflow: `Deploy`*